src/modIntegrador/wsdl/xmlDesbloqueio/16_03_2018_14_01_43_94200.xml

<soapenv:Envelope xmlns:trip1="http://www.neolog.com.br/cpl/acquisition/tripLoadsSourceId/" xmlns:trip="http://www.neolog.com.br/cpl/acquisition/tripReleaseResponse/" xmlns:ord2="http://www.neolog.com.br/cpl/acquisition/orderBreakResponse/" xmlns:ord1="http://www.neolog.com.br/cpl/acquisition/orderBreakId/" xmlns:ord="http://www.neolog.com.br/cpl/acquisition/orderBreakRemovalRequest/" xmlns:erp="http://www.neolog.com.br/cpl/acquisition/eRPMessageResponse/" xmlns:unb="http://www.neolog.com.br/cpl/acquisition/unblockRelTrip/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
        <soapenv:Header/>
        <soapenv:Body>
          <unb:doUnblockReleasedTrip>
              <unb:unblockReleasedTrips>
                <unb:unblockReleasedTrips>
                    <unb:unblockReleasedTrip>
                      <unb:ERPMessageResponses>
                          <erp:eRPMessageResponseList>
                            <erp:ERPMessageResponses>
                                <erp:eRPMessageResponse>
                                  <erp:msg>Liberação Aprovada</erp:msg>
                                </erp:eRPMessageResponse>
                            </erp:ERPMessageResponses>
                          </erp:eRPMessageResponseList>
                      </unb:ERPMessageResponses>
                      <unb:identifier>3498</unb:identifier>
                      <unb:regionSourceId>DEFAULT</unb:regionSourceId>
                      <unb:tripReleaseResponses>
                          <trip:tripReleaseResponseList>
                            <trip:tripReleaseResponses>
                              <trip:tripReleaseResponse>
                <trip:attributes>
                  <trip:attribute>
                      <trip:name>tripTransportDocument</trip:name>
                      <trip:value>QA_DTTRIP_0001</trip:value>
                  </trip:attribute>
                </trip:attributes>
                <trip:itemId>100691_11</trip:itemId>
                <trip:msg>Desbloqueio Aprovado</trip:msg>
                <trip:orderSourceId>100691_11_100691</trip:orderSourceId>
                <trip:regionSourceId>DEFAULT</trip:regionSourceId>
                <trip:status>1</trip:status>
                <trip:tripCode>94200</trip:tripCode>
            </trip:tripReleaseResponse><trip:tripReleaseResponse>
                <trip:attributes>
                  <trip:attribute>
                      <trip:name>tripTransportDocument</trip:name>
                      <trip:value>QA_DTTRIP_0001</trip:value>
                  </trip:attribute>
                </trip:attributes>
                <trip:itemId>100691_12</trip:itemId>
                <trip:msg>Desbloqueio Aprovado</trip:msg>
                <trip:orderSourceId>100691_11_100691</trip:orderSourceId>
                <trip:regionSourceId>DEFAULT</trip:regionSourceId>
                <trip:status>1</trip:status>
                <trip:tripCode>94200</trip:tripCode>
            </trip:tripReleaseResponse><trip:tripReleaseResponse>
                <trip:attributes>
                  <trip:attribute>
                      <trip:name>tripTransportDocument</trip:name>
                      <trip:value>QA_DTTRIP_0001</trip:value>
                  </trip:attribute>
                </trip:attributes>
                <trip:itemId>100880_11</trip:itemId>
                <trip:msg>Desbloqueio Aprovado</trip:msg>
                <trip:orderSourceId>100880_11_100880</trip:orderSourceId>
                <trip:regionSourceId>DEFAULT</trip:regionSourceId>
                <trip:status>1</trip:status>
                <trip:tripCode>94200</trip:tripCode>
            </trip:tripReleaseResponse><trip:tripReleaseResponse>
                <trip:attributes>
                  <trip:attribute>
                      <trip:name>tripTransportDocument</trip:name>
                      <trip:value>QA_DTTRIP_0001</trip:value>
                  </trip:attribute>
                </trip:attributes>
                <trip:itemId>100880_11</trip:itemId>
                <trip:msg>Desbloqueio Aprovado</trip:msg>
                <trip:orderSourceId>100880_11_100880</trip:orderSourceId>
                <trip:regionSourceId>DEFAULT</trip:regionSourceId>
                <trip:status>1</trip:status>
                <trip:tripCode>94200</trip:tripCode>
            </trip:tripReleaseResponse><trip:tripReleaseResponse>
                <trip:attributes>
                  <trip:attribute>
                      <trip:name>tripTransportDocument</trip:name>
                      <trip:value>QA_DTTRIP_0001</trip:value>
                  </trip:attribute>
                </trip:attributes>
                <trip:itemId>100689_11</trip:itemId>
                <trip:msg>Desbloqueio Aprovado</trip:msg>
                <trip:orderSourceId>100689_11_100689</trip:orderSourceId>
                <trip:regionSourceId>DEFAULT</trip:regionSourceId>
                <trip:status>1</trip:status>
                <trip:tripCode>94200</trip:tripCode>
            </trip:tripReleaseResponse><trip:tripReleaseResponse>
                <trip:attributes>
                  <trip:attribute>
                      <trip:name>tripTransportDocument</trip:name>
                      <trip:value>QA_DTTRIP_0001</trip:value>
                  </trip:attribute>
                </trip:attributes>
                <trip:itemId>100691_11</trip:itemId>
                <trip:msg>Desbloqueio Aprovado</trip:msg>
                <trip:orderSourceId>100691_11_100691</trip:orderSourceId>
                <trip:regionSourceId>DEFAULT</trip:regionSourceId>
                <trip:status>1</trip:status>
                <trip:tripCode>94200</trip:tripCode>
            </trip:tripReleaseResponse><trip:tripReleaseResponse>
                <trip:attributes>
                  <trip:attribute>
                      <trip:name>tripTransportDocument</trip:name>
                      <trip:value>QA_DTTRIP_0001</trip:value>
                  </trip:attribute>
                </trip:attributes>
                <trip:itemId>100839_11</trip:itemId>
                <trip:msg>Desbloqueio Aprovado</trip:msg>
                <trip:orderSourceId>100839_11_100839</trip:orderSourceId>
                <trip:regionSourceId>DEFAULT</trip:regionSourceId>
                <trip:status>1</trip:status>
                <trip:tripCode>94200</trip:tripCode>
            </trip:tripReleaseResponse><trip:tripReleaseResponse>
                <trip:attributes>
                  <trip:attribute>
                      <trip:name>tripTransportDocument</trip:name>
                      <trip:value>QA_DTTRIP_0001</trip:value>
                  </trip:attribute>
                </trip:attributes>
                <trip:itemId>100881_11</trip:itemId>
                <trip:msg>Desbloqueio Aprovado</trip:msg>
                <trip:orderSourceId>100881_11_100881</trip:orderSourceId>
                <trip:regionSourceId>DEFAULT</trip:regionSourceId>
                <trip:status>1</trip:status>
                <trip:tripCode>94200</trip:tripCode>
            </trip:tripReleaseResponse><trip:tripReleaseResponse>
                <trip:attributes>
                  <trip:attribute>
                      <trip:name>tripTransportDocument</trip:name>
                      <trip:value>QA_DTTRIP_0001</trip:value>
                  </trip:attribute>
                </trip:attributes>
                <trip:itemId>100878_11</trip:itemId>
                <trip:msg>Desbloqueio Aprovado</trip:msg>
                <trip:orderSourceId>100878_11_100878</trip:orderSourceId>
                <trip:regionSourceId>DEFAULT</trip:regionSourceId>
                <trip:status>1</trip:status>
                <trip:tripCode>94200</trip:tripCode>
            </trip:tripReleaseResponse><trip:tripReleaseResponse>
                <trip:attributes>
                  <trip:attribute>
                      <trip:name>tripTransportDocument</trip:name>
                      <trip:value>QA_DTTRIP_0001</trip:value>
                  </trip:attribute>
                </trip:attributes>
                <trip:itemId>100839_11</trip:itemId>
                <trip:msg>Desbloqueio Aprovado</trip:msg>
                <trip:orderSourceId>100839_11_100839</trip:orderSourceId>
                <trip:regionSourceId>DEFAULT</trip:regionSourceId>
                <trip:status>1</trip:status>
                <trip:tripCode>94200</trip:tripCode>
            </trip:tripReleaseResponse><trip:tripReleaseResponse>
                <trip:attributes>
                  <trip:attribute>
                      <trip:name>tripTransportDocument</trip:name>
                      <trip:value>QA_DTTRIP_0001</trip:value>
                  </trip:attribute>
                </trip:attributes>
                <trip:itemId>100879_11</trip:itemId>
                <trip:msg>Desbloqueio Aprovado</trip:msg>
                <trip:orderSourceId>100879_11_100879</trip:orderSourceId>
                <trip:regionSourceId>DEFAULT</trip:regionSourceId>
                <trip:status>1</trip:status>
                <trip:tripCode>94200</trip:tripCode>
            </trip:tripReleaseResponse><trip:tripReleaseResponse>
                <trip:attributes>
                  <trip:attribute>
                      <trip:name>tripTransportDocument</trip:name>
                      <trip:value>QA_DTTRIP_0001</trip:value>
                  </trip:attribute>
                </trip:attributes>
                <trip:itemId>100878_11</trip:itemId>
                <trip:msg>Desbloqueio Aprovado</trip:msg>
                <trip:orderSourceId>100878_11_100878</trip:orderSourceId>
                <trip:regionSourceId>DEFAULT</trip:regionSourceId>
                <trip:status>1</trip:status>
                <trip:tripCode>94200</trip:tripCode>
            </trip:tripReleaseResponse><trip:tripReleaseResponse>
                <trip:attributes>
                  <trip:attribute>
                      <trip:name>tripTransportDocument</trip:name>
                      <trip:value>QA_DTTRIP_0001</trip:value>
                  </trip:attribute>
                </trip:attributes>
                <trip:itemId>100689_11</trip:itemId>
                <trip:msg>Desbloqueio Aprovado</trip:msg>
                <trip:orderSourceId>100689_11_100689</trip:orderSourceId>
                <trip:regionSourceId>DEFAULT</trip:regionSourceId>
                <trip:status>1</trip:status>
                <trip:tripCode>94200</trip:tripCode>
            </trip:tripReleaseResponse><trip:tripReleaseResponse>
                <trip:attributes>
                  <trip:attribute>
                      <trip:name>tripTransportDocument</trip:name>
                      <trip:value>QA_DTTRIP_0001</trip:value>
                  </trip:attribute>
                </trip:attributes>
                <trip:itemId>100881_11</trip:itemId>
                <trip:msg>Desbloqueio Aprovado</trip:msg>
                <trip:orderSourceId>100881_11_100881</trip:orderSourceId>
                <trip:regionSourceId>DEFAULT</trip:regionSourceId>
                <trip:status>1</trip:status>
                <trip:tripCode>94200</trip:tripCode>
            </trip:tripReleaseResponse><trip:tripReleaseResponse>
                <trip:attributes>
                  <trip:attribute>
                      <trip:name>tripTransportDocument</trip:name>
                      <trip:value>QA_DTTRIP_0001</trip:value>
                  </trip:attribute>
                </trip:attributes>
                <trip:itemId>100879_11</trip:itemId>
                <trip:msg>Desbloqueio Aprovado</trip:msg>
                <trip:orderSourceId>100879_11_100879</trip:orderSourceId>
                <trip:regionSourceId>DEFAULT</trip:regionSourceId>
                <trip:status>1</trip:status>
                <trip:tripCode>94200</trip:tripCode>
            </trip:tripReleaseResponse>
                            </trip:tripReleaseResponses>
                      </trip:tripReleaseResponseList>
                    </unb:tripReleaseResponses>
                  </unb:unblockReleasedTrip>
                </unb:unblockReleasedTrips>
              </unb:unblockReleasedTrips>
          </unb:doUnblockReleasedTrip>
        </soapenv:Body>
      </soapenv:Envelope>